# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define boss = Character('Босс', color="#c8ffc8")
define hero = Character('Главный герой', color="#c8ffc8")
define friend = Character('Друг', color="#c8ffc8")
define col_1 = Character('Коллега 1', color="#c8ffc8")
define col_2 = Character('Коллега 2', color="#c8ffc8")
define g_3 = Character('Девочка 3', color="#c8ffc8")
define g_4 = Character('Девочка 4', color="#c8ffc8")
default counter = 50
# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

init python:
    def eyewarp(x):
        return x**1.33
    eye_open = ImageDissolve("eye.png", .5, ramplen=128, reverse=False, time_warp=eyewarp)
    eye_slight_open = ImageDissolve("eye.png", 2, ramplen=128, reverse=False, time_warp=eyewarp)
    eye_slight_shut = ImageDissolve("eye.png", 2, ramplen=128, reverse=True, time_warp=eyewarp)
    eye_shut = ImageDissolve("eye.png", .5, ramplen=128, reverse=True, time_warp=eyewarp)
image black:
    Solid("#000")
image white:
    Solid("#FFF")


# Игра начинается здесь:
label start:
    jump morning



label morning:
    scene black
    play music "audio/alarm.mp3"
    "{i}*будильник*"
    scene floor v4
    with eye_slight_open
    scene black
    with eye_slight_shut
    stop music
    hero "Мм, еще немного поспа..."
    scene black
    with eye_shut
    hero "Z-z-z"
    pause 0.5
    play music "audio/alarm.mp3"
    "{i}*будильник*"
    scene floor v4
    with eye_open
    stop music
    hero "Ой, ёшки макарошки, я что, проспал???"

    scene home v1
    with fade
    hero "Ух, чуть не проспал..."
    
    hero "Надо бы быстренько сделать себе чего-нибудь поесть и уже начать собираться, а то сегодня на работе у меня много дел..."

    scene clock
    with fade

    hero "Ой, уже почти 9! Мне пора бежать на работу! Ладно, поем по дороге..."

    scene street summer day
    with fade

    hero "Надеюсь, успею сесть на метро и не опоздать, а то босс такое не прощает..."

    hero "А погодка-то ничего..."

    hero "Вот бы сейчас отдохнуть на природе или просто погулять с друзьями, а не вот это вот всё..."

    scene train day
    with fade

    hero "Фух, вроде успеваю..."

    hero "Это мне еще повезло, а то босс бы на самом деле уничтожил..."

    hero "Да и перед коллегами не очень удобно бы вышло... Все работают, а я отдыхаю постоянно, да еще и хожу сонный весь день..."

    hero "Надо переставать играть по ночам, а то утром практически невозможно встать..."

    scene street
    with fade

    hero "Ладно, доехал без проишествий... И почти вовремя..."

    hero "Осталось только дойти до офиса... По дороге захвачу что-нибудь поесть..."

    scene building
    with fade

    hero "Вот я и на месте, главное сейчас быстренько добежать до своего рабочего места и не попасться боссу на глаза..."

    show friend smile at center:
        zoom 0.75
    with Dissolve(.5)

    pause 0.5

    hero "{i}*а, отлично, вот и он...*"

    boss "Ну здравствуй, другалек... Гуляешь?"

    hero "Здравствуйте, ээ... да вот вышел себе чего-ниубдь купить, а то утром так спешил на работу, что даже не успел ничего поесть..."

    boss "Понятно. Снова проспал..."

    boss "Когда-нибудь ты доиграешься, ты же это понимаешь? Тебе стоит более ответственно подходить к таким важным вещам, как работа... Тебе ведь уже не 10 лет..."

    boss "Помимо того, что ты подставляешь себя, так ты еще подставляешь и своих коллег, и меня, вынуждая отчитывать тебя за такие \"мелочи\"..."

    boss "Этого всего ведь можно легко избежать... Просто потарайся быть немного дисциплинированнее."

    menu:
        "Я всё успеваю и так":
            jump shark_1
        "Извините пожалуйста":
            jump teddy_1
        "Постараться свалить":
            jump turtle_1
        "Я могу оставаться на переработку":
            jump fox_1
        "Переведите меня на удалёнку":
            jump owl_1


label shark_1:
    hero "Босс, да я и так всё успеваю делать по работе... Ничего ведь страшного не случилось, что я опоздал немного."

    boss "Как ничего страшного?! Ты должен приходить на работу вовремя, это касается всех и тебя в том числе!"

    hero "А в чем разница прийти вовремя или на несколько минут позже, я ведь за рабочий день сделаю один и тот же объем работы..."

    boss "Что??? Ты не понимаешь в чем разница??? Тогда после обеда буду ждать в своем кабинете! И чтоб хотя бы ко мне не опоздал, ясно?! А сейчас иди работай!"

    hero "{i}*тоже мне, раскомандовался...*"

    jump office_1

label teddy_1:
    hero "Босс, извините пожалуйста, я действительно проспал и немного опоздал, даже поесть толком не успел..."

    hero "Даже не знаю, как так вышло... Но я обещаю, что больше такого никогда не повторится!"

    boss "В который раз я это слышу... Пойми, я же хочу, чтобы всем было хорошо и всех все устраивало. Думаешь, мне нравится отчитывать тебя?"

    boss "Ладно, думаю, что ты все понял... Надеюсь, ты на самом деле повзрослеешь и впредь больше не дашь мне повода разговаривать с тобой на такие темы..."

    boss "А сейчас, иди работай."

    hero "Спасибо большое, босс! Я вас не подведу! Спасибо!"

    hero "{i}*повезло же мне с боссом, могло быть и хуже...*"

    jump office_1

label turtle_1:
    hero "Да, извините, я всё понимаю, но мне надо идти работать, я не хочу опоздать еще больше..."

    boss "Стой, ты куда? Мы еще не закончили!"

    hero "{i}*просто иди работать... босс побесится еще немного и успокоится, я надеюсь...*"

    boss "Ух, я тебе это припомню, все твои опоздания еще скажут о себе!"

    hero "{i}*ладно, на этот раз вроде кое-как пронесло...*"

    jump office_1

label fox_1:
    hero "Да, босс, я все понимаю, но может мы как-нибудь найдем компромисс в этой ситуации?"

    boss "И что же ты предлагаешь?"

    hero "Давайте всегда, когда я буду опаздывать, что я конечно же постараюсь перестать делать, я буду оставаться на переработку."

    boss "Ох, ты меня доведешь... Ладно, сегодня задержишься на полчаса после работы, нужно будет кое-что сделать... А сейчас, иди работать."

    hero "{i}*фух, вроде бы договорились...*"

    hero "{i}*прадва теперь придется остаться после работы... но могло быть и хуже...*"

    jump office_1

label owl_1:
    hero "Да, босс, я все понял, но я предлагаю вот что: давайте вы переведете меня на удаленную работу по средам..."

    hero "Всем ведь будет хорошо, все будут в плюсе: я буду работать из дома и не буду опаздывать, а вы не будете меня отчитывать за опоздания!"

    boss "Смотри, что он придумал... Ну ладно, я подумаю конечно..."

    hero "Спасибо, босс!"

    boss "Да да, теперь иди работай."

    hero "{i}*ну вот и отлично, теперь по средам, скорее всего, буду работать из дома...*"

    jump office_1




label office_1:
    scene office
    with fade

    hero "{i}*вот и начался мой рабочий день...*"

    hero "{i}*так, сейчас надо кое-что сдел...*"

    hero "Ё маё, что это такое? Где мои документы, что это за немытые кружки из под чая и кофе повсюду?? Что за бардак на рабочем месте???"

    pause 0.5

    show friend two smile at center:
        zoom 0.75
    with Dissolve(.5)

    col_1 "Ой, привет, это ты... Слушай, можно я поставлю эти игрушки к тебе, а то у меня уже нет места на столе..."

    hero "Какие игрушки? Это что, всё твоё??"

    col_1 "Ну да, а что не так? Мне так лучше думается..."

    hero "Всмысле что не так? Тут начинается мое рабочее место, и мне комфортнее и приятнее сидеть там, где чистота и порядок!"

    col_1 "Да ладно тебе, жалко что ли? У меня просто места нет уже, ты должен понять..."

    menu:
        "Выкинуть все вещи":
            jump shark_2
        "Высказать недовольство":
            jump teddy_2
        "Перенести вещи и уйти":
            jump turtle_2
        "Помочь с уборкой":
            jump fox_2
        "Принести мусорное ведро и коробку для вещей":
            jump owl_2


label shark_2:
    hero "Короче мне это надоело... Раз ты не хочешь, то я сам все уберу."

    col_1 "Нет, ничего не трогай!"

    col_1 "У меня сейчас встреча, так что я ухожу. Еще раз говорю, ничего не трогай!"

    hide friend two smile
    with Dissolve(.5)

    pause 0.5

    hero "{i}*да конечно, все я прям так и оставлю...*"

    hero "{i}*выкину всё подальше, чтоб не мешало...*"

    pause 2

    hero "Вот и готово."

    show friend two smile at center:
        zoom 0.75
    with Dissolve(.5)

    col_1 "Ой, я забыл телефон..."

    col_1 "Нет!"

    col_1 "Ну и где всё? Я же сказала ничего не трогать! Ух, ты у меня получишь еще!"

    hide friend two smile
    with Dissolve(.5)

    hero "{i}*да да...*"

    jump office_2

label teddy_2:
    hero "Да понимаешь, я люблю работать в чистоте. Мне не особо приятно, когда вокруг меня лежат разные ненужные мне в данный момент вещи..."

    hero "Все эти вещи ты можешь положить к себе на стол, если аккуратно расставить их по местам. И не нужно будет использовать моё место..."

    col_1 "Знаешь, а мне лучше работается вот так, поэтому я буду делать так, как удобно мне!"

    hero "Но..."

    col_1 "Если что-то хочешь, сказать, жалуйся боссу, хотя от этого вряд ли что-то изменится..."

    col_1 "Всё, у меня встреча, я ухожу."

    hide friend two smile
    with Dissolve(.5)

    pause 1

    hero "{i}*вот тебе раз... не хотел конфликтовать, а тут раз и такое...*"

    hero "{i}*ну даёт...*"

    jump office_2

label turtle_2:
    hero "Слушай, я не хочу с тобой конфликтовать по этому поводу. Я просто уберу твои вещи со своего стола и займусь делами..."

    col_1 "Нет! Ничего не трогай! Это мои вещи!"

    pause 2

    col_1 "Нет, верни все на место!"

    hero "Извини, мне нужно идти..."

    col_1 "Нет, сначала верни все на место, потом иди по своим делам!"

    pause 0.5

    col_1 "Стой! Ты куда!"

    hide friend two smile
    with Dissolve(.5)

    hero "{i}*ладно, главное свой стол немного прибрал... не хочу с ней разговаривать на эту тему, она все равно не поймет...*"

    jump office_2

label fox_2:
    hero "Так, я тебя понял. Давай поступим так: я буду тебе помогать разбираться с бардаком так, чтобы и тебе было хорошо, и моё место оставалось чистым."

    col_1 "Ну мне удобно так... Я не хочу ничего менять, мне так лучше работается..."

    show friend smile at center:
        zoom 0.75
    with Dissolve(.5)

    boss "Так, что тут происходит?"

    hero "Да всё хорошо, босс, просто у неё есть некоторые трудности в поддержании чистоты рабочего места. Причем и моего тоже..."

    boss "Да? Действительно, какой-то хаос у вас на столе... Нужно это прибрать!"

    col_1 "Нуу... Мне же удобнее работать так..."

    boss "Нет, у нас тут не мусорка. Кружки надо вымыть, мятую бумагу нужно выкинуть в мусорку!"

    col_1 "Но..."

    boss "Никаких но! Рабочее место должно находиться в порядке."

    boss "Всё, я пошел работать. В отличие от вас, у меня её много."

    hide friend smile
    with Dissolve(.5)

    hero "Ну так что, согласна с моей идеей?"

    col_1 "Да, а что еще поделать... Давай убираться, раз предложил..."

    hero "Давай только чуть попозже, у меня сейчас дела..."

    col_1 "Хорошо."

    hide friend two smile
    with Dissolve(.5)

    hero "{i}*отлично, вот и договорились... теперь хоть немного будет чище...*"

    jump office_2

label owl_2:
    hero "Так, хорошо. А почему бы тебе не поставить все эти вещи к себе на стол или куда-нибудь по близости?"

    col_1 "Ну мне удобно, когда так... Да и вообще, куда еще деть весь этот мусор?"

    hero "Ну так очевидно в мусорное ведро..."

    col_1 "Если бы оно было... то да..."

    hero "Так у тебя нет мусорки?"

    col_1 "Да... Да и нужные вещи некуда складывать... У меня пара ящиков, и то, забиты всякими документами..."

    hero "Так это легко исправить! Секунду..."

    col_1 "???"

    pause 2

    hero "Вот тебе мусорка, а вот тебе коробка для вещей..."

    col_1 "Ваау! Спасибо огромное! Теперь я смогу разложить свои вещи получше! Спасибо!"

    hero "Не за что... Ладно, мне пора, у меня работа!"

    col_1 "Да, хорошо... Спасибо еще раз!"

    hide friend two smile
    with Dissolve(.5)

    hero "{i}*ну вот и отлично, теперь на моем рабочем месте будет чистота и порядок... правда пришлось повозиться с поиском мусорки и коробки, но ничего...*"
    
    jump office_2





label office_2:
    scene stairs day
    with fade

    pause 1

    hero "Так, сейчас надо..."

    "{i}*телефон*"

    hero "Оо, кто это звонит, не может быть..."

    hero "Але..."

    friend "Здарова, старый! Что ты, как ты?"

    hero "Да все отлично! Вот на работе сейчас. Давно не общались..."

    friend "Ну и хорошо, что все хорошо... А работа дело такое, это да..."

    friend "Слушай, как раз по поводу \"давно не общались\" - не хочешь завтра встретиться и сходить куда-нибудь?"

    friend "Посидим, поболтаем, как в старые добрые..."

    hero "О, отличная идея!"

    friend "Потом как проводишь меня на самолет..."

    hero "Стой, какой самолет? Ты улетаешь?"

    friend "Да, брат, мне нужно срочно улететь по делам... Даже не знаю, когда вернусь... Поэтому и хотел встретиться с тобой..."

    friend "Правда я сейчас на другом конце города, поэтому не знаю даже, сможешь ли ты приехать..."

    hero "Да, понимаю... Ой, сейчас, погоди, тут по работе отвлекают..."

    friend "Да, без проблем..."

    show girl four smile at center:
        zoom 0.75
    with Dissolve(.5)

    col_2 "О, привет, а я тебя повсюду ищу... Нужно будет помочь мне... Ты мне завтра нужен на очень важном совещании!"

    col_2 "Оно будет проходить днём, это часика на 3-4..."

    hero "А нельзя его как-нибудь перенести?"

    col_2 "Нет! Ты что? Там будут важные люди, инвесторы и директора!"

    col_2 "И не вздумай отказываться!"

    hero "{i}*ух... очень \"удачно\" все выходит...*"

    hero "{i}*что же делать...*"

    menu:
        "Разберись сама":
            jump shark_3
        "Хорошо, я буду":
            jump teddy_3
        "У меня важный звонок":
            jump turtle_3
        "Хорошо, только не долго":
            jump fox_3
        "Давай сейчас что-нибудь придумаем":
            jump owl_3


label shark_3:
    hero "Слушай, у меня завтра дела, поэтому я не смогу быть на этом совещании."

    col_2 "Не поняла? Как не сможешь? Какие дела? Я спрашивала у босса, и он сказал, что ты завтра свободен..."

    hero "Ну у меня появились неотложные дела, поэтому меня не будет."

    col_2 "Нет, так не пойдет! Что у тебя за дела, которые важнее работы? Важнее совещания с директорами?"

    hero "Я же сказал, у меня дела. Точка."

    col_2 "Ну знаешь ли... Когда босс узнает... Тебе несдобровать..."

    hero "Ага... Все, у меня дела, не мешай"

    hide girl four smile
    with Dissolve(.5)

    hero "Ало, брат... Да, я буду. Давай завтра днем и встретимся, а вечерком я тебя провожу."

    friend "Вот и отлично! Я даже и не сомневался! Ладно, давай, до завтра! Удачи на работе!"

    hero "Спасибо."
    
    hero "{i}*она мне понадобится...*"
    
    jump office_3

label teddy_3:
    hero "Да, хорошо, я буду там..."

    col_2 "Ну вот и отлично. Тогда вечером обсудим это."

    col_2 "До вечера. И без шуточек!"

    hide girl four smile
    with Dissolve(.5)

    pause 1

    hero "Ало, брат... Извини уж, тут на работе завал, завтра вообще никак не получается..."

    friend "Да, всё понимаю... Ну что поделать... Тогда до встречи, может еще увидимся когда-нибудь..."

    hero "Давай... удачи."

    friend "И тебе."

    pause 1

    hero "{i}*как-то неудобно получилось... но что поделать, если я еще раз подставлю босса, то он мне голову открутит...*"

    jump office_3

label turtle_3:
    hero "Так, у меня тут важный звонок, не мешай"

    col_2 "Всмысле \"не мешай\"? У нас завтр..."

    hero "Важный звонок, говорю. Давай потом"

    hero "{i}*уходим...*"

    col_2 "Стой! Ты куда? Совещание! Завтра!"

    hide girl four smile
    with Dissolve(.5)

    pause 1

    hero "{i}*вроде пока пронесло...*"

    hero "Ало, брат... Да, я буду. Давай завтра днем и встретимся, а вечерком я тебя провожу."

    friend "Вот и отлично! Я даже и не сомневался! Ладно, давай, до завтра! Удачи на работе!"

    hero "Спасибо."
    
    hero "{i}*она мне понадобится...*"

    jump office_3

label fox_3:
    hero "Хорошо, я буду, только на часик-полтора. У меня потом важная встреча..."

    col_2 "Но за полтора часа мы не успеем рассказать и показать всё!"

    hero "Давай показ устроим вместе, а дальше ты сама. Все основные моменты я тебе расскажу сегодня, а завтра ты их просто передашь всем на совещании. И я не нужен буду..."

    col_2 "Ух, ну ты умеешь подставлять конечно. Ну давай, уж лучше так..."

    col_2 "Тогда сегодня еще встретимся и обсудим этот момент..."

    hero "Да, хорошо"

    hide girl four smile
    with Dissolve(.5)

    pause 1

    hero "Ало, брат... В общем, я думаю, у нас не получится посидеть поболтать, много работы. Но я смогу тебя проводить на самолёт!"

    friend "Да? Обидно конечно... Ну ладно, хотя бы проводишь... Думаю, успеем поболтать еще по дороге и даже онлайн..."

    hero "Ага, конечно!"

    friend "Ладно, давай, до завтра! Удачи на работе!"
    
    hero "Спасибо."

    hero "{i}*она мне понадобится...*"

    jump office_3

label owl_3:
    hero "Да, хорошо, я буду там..."

    col_2 "Ну вот и отлично. Тогда вечером обсудим это."

    col_2 "До вечера. И без шуточек!"

    hide girl four smile
    with Dissolve(.5)

    pause 1

    hero "Ало, брат... Слушай, а может встретимся сегодня вечером? Посидим и поболтаем... А то я завтра ну никак не смогу, работа..."

    friend "А это хорошая идея! Давай так и сделаем!"

    hero "Давай. Тогда в 7 созвонимся..."

    friend "Вот и отлично! Ладно, давай, не отвлекаю... Удачи на работе!"

    hero "Спасибо."
    
    hero "{i}*она мне понадобится...*"

    jump office_3




label office_3:
    return




    
# label start:


#     $ renpy.movie_cutscene("На_старт.webm")

#     scene home v1

#     menu:
#         "A":
#             $ counter = counter + 1
#             jump a
#         "B":
#             $ counter = counter + 2
#             jump b

# label a:
#     scene boss office night

#     $ c = 10

#     hero "It's A! [counter] + [c]"

#     return

# label b:
#     scene boss office night

#     $ c = 20

#     hero "It's B! [counter] + [c]"

#     return
    


    # scene boss office night

    # show friend smile at center:
    #     zoom 0.75

    # e_1 "Здарова, я босс, если что."


    # scene street

    # show girl smile at center:
    #     zoom 0.85

    # g "Привет!"

    # scene stairs evening

    # show girl two angry at center:
    #     zoom 0.85

    # g_2 "Эй!"

    # scene cafeteria day

    # show girl three delighted at center:
    #     zoom 0.85

    # g_3 "Юхуу, минус 3!"

    # scene office

    # show girl four sad at center:
    #     zoom 0.85

    # g_4 "Плачу..."

    # scene train day rain

    # show friend two surprised at center:
    #     zoom 0.85

    # e_2 "Nani?"

    return
