# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define boss = Character('Босс', color="#c8ffc8")
define hero = Character('Главный герой', color="#c8ffc8")
define g = Character('Девочка 1', color="#c8ffc8")
define g_2 = Character('Девочка 2', color="#c8ffc8")
define g_3 = Character('Девочка 3', color="#c8ffc8")
define g_4 = Character('Девочка 4', color="#c8ffc8")
default counter = 50
# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

init python:
    def eyewarp(x):
        return x**1.33
    eye_open = ImageDissolve("eye.png", .5, ramplen=128, reverse=False, time_warp=eyewarp)
    eye_slight_open = ImageDissolve("eye.png", 2, ramplen=128, reverse=False, time_warp=eyewarp)
    eye_slight_shut = ImageDissolve("eye.png", 2, ramplen=128, reverse=True, time_warp=eyewarp)
    eye_shut = ImageDissolve("eye.png", .5, ramplen=128, reverse=True, time_warp=eyewarp)
image black:
    Solid("#000")
image white:
    Solid("#FFF")


# Игра начинается здесь:
label start:
    jump morning

label morning:
    scene black
    play music "audio/alarm.mp3"
    "{i}*будильник*"
    scene floor v4
    with eye_slight_open
    scene black
    with eye_slight_shut
    stop music
    hero "Мм, еще немного поспа..."
    scene black
    with eye_shut
    hero "Z-z-z"
    pause 0.5
    play music "audio/alarm.mp3"
    "{i}*будильник*"
    scene floor v4
    with eye_open
    stop music
    hero "Ой, ёшки макарошки, я что, проспал???"

    scene home v1
    with fade
    hero "Ух, чуть не проспал..."
    
    hero "Надо бы быстренько сделать себе чего-нибудь поесть и уже начать собираться, а то сегодня на работе у меня много дел..."


    scene clock
    with fade

    hero "Ой, уже почти 9! Мне пора бежать на работу! Ладно, поем по дороге..."


    scene street summer day
    with fade

    hero "Надеюсь, успею сесть на метро и не опоздать, а то босс такое не прощает..."

    hero "А погодка-то ничего..."

    hero "Вот бы сейчас отдохнуть на природе или просто погулять с друзьями, а не вот это вот всё..."


    scene train day
    with fade

    hero "Фух, вроде успеваю..."

    hero "Это мне еще повезло, а то босс бы на самом деле уничтожил..."

    hero "Да и перед коллегами не очень удобно бы вышло... Все работают, а я отдыхаю постоянно, да еще и хожу сонный весь день..."

    hero "Надо переставать играть по ночам, а то утром практически невозможно встать..."

    scene street
    with fade

    hero "Ладно, доехал без проишествий... И почти вовремя..."

    hero "Осталось только дойти до офиса... По дороге захвачу что-нибудь поесть..."


    scene building
    with fade

    hero "Вот я и на месте, главное сейчас быстренько добежать до своего рабочего места и не попасться боссу на глаза..."

    show friend smile at center:
        zoom 0.75
    with Dissolve(.5)

    pause 0.5

    hero "{i}*а, отлично, вот и он...*"

    boss "Ну здравствуй, другалек... Гуляешь?"

    hero "Здравствуйте, ээ... да вот вышел себе чего-ниубдь купить, а то утром так спешил на работу, что даже не успел ничего поесть..."

    boss "Понятно. Снова проспал..."

    boss "Когда-нибудь ты доиграешься, ты же это понимаешь? Тебе стоит более ответственно подходить к таким важным вещам, как работа... Тебе ведь уже не 10 лет..."

    boss "Помимо того, что ты подставляешь себя, так ты еще подставляешь и своих коллег, и меня, вынуждая отчитывать тебя за такие \"мелочи\"..."

    boss "Этого всего ведь можно легко избежать... Просто потарайся быть немного дисциплинированнее."

    menu:
        "Я всё успеваю и так":
            jump shark_1
        "Извините пожалуйста":
            jump teddy_1
        "Постараться свалить":
            jump turtle_1
        "Я могу оставаться на переработку":
            jump fox_1
        "Переведите меня на удалёнку":
            jump owl_1


label shark_1:
    hero "Босс, да я и так всё успеваю делать по работе... Ничего ведь страшного не случилось, что я опоздал немного."

    boss "Как ничего страшного?! Ты должен приходить на работу вовремя, это касается всех и тебя в том числе!"

    hero "А в чем разница прийти вовремя или на несколько минут позже, я ведь за рабочий день сделаю один и тот же объем работы..."

    boss "Что??? Ты не понимаешь в чем разница??? Тогда после обеда буду ждать в своем кабинете! И чтоб хотя бы ко мне не опоздал, ясно?! А сейчас иди работай!"

    hero "{i}*тоже мне, раскомандовался...*"

    jump office_1

label teddy_1:
    hero "Босс, извините пожалуйста, я действительно проспал и немного опоздал, даже поесть толком не успел..."

    hero "Даже не знаю, как так вышло... Но я обещаю, что больше такого никогда не повторится!"

    boss "В который раз я это слышу... Пойми, я же хочу, чтобы всем было хорошо и всех все устраивало. Думаешь, мне нравится отчитывать тебя?"

    boss "Ладно, думаю, что ты все понял... Надеюсь, ты на самом деле повзрослеешь и впредь больше не дашь мне повода разговаривать с тобой на такие темы..."

    boss "А сейчас, иди работай."

    hero "Спасибо большое, босс! Я вас не подведу! Спасибо!"

    hero "{i}*повезло же мне с боссом, могло быть и хуже...*"

    jump office_1

label turtle_1:
    hero "Да, извините, я всё понимаю, но мне надо идти работать, я не хочу опоздать еще больше..."

    boss "Стой, ты куда? Мы еще не закончили!"

    hero "{i}*просто иди работать... босс побесится еще немного и успокоится, я надеюсь...*"

    boss "Ух, я тебе это припомню, все твои опоздания еще скажут о себе!"

    hero "{i}*ладно, на этот раз вроде кое-как пронесло...*"

    jump office_1

label fox_1:
    hero "Да, босс, я все понимаю, но может мы как-нибудь найдем компромисс в этой ситуации?"

    boss "И что же ты предлагаешь?"

    hero "Давайте всегда, когда я буду опаздывать, что я конечно же постараюсь перестать делать, я буду оставаться на переработку."

    boss "Ох, ты меня доведешь... Ладно, сегодня задержишься на полчаса после работы, нужно будет кое-что сделать... А сейчас, иди работать."

    hero "{i}*фух, вроде бы договорились...*"

    hero "{i}*прадва теперь придется остаться после работы... но могло быть и хуже...*"

    jump office_1

label owl_1:
    hero "Да, босс, я все понял, но я предлагаю вот что: давайте вы переведете меня на удаленную работу по средам..."

    hero "Всем ведь будет хорошо, все будут в плюсе: я буду работать из дома и не буду опаздывать, а вы не будете меня отчитывать за опоздания!"

    boss "Смотри, что он придумал... Ну ладно, я подумаю конечно..."

    hero "Спасибо, босс!"

    boss "Да да, теперь иди работай."

    hero "{i}*ну вот и отлично, теперь по средам, скорее всего, буду работать из дома...*"

    jump office_1





label office_1:
    hero "КОНЕЦ"

    return








# label start:


#     $ renpy.movie_cutscene("На_старт.webm")

#     scene home v1

#     menu:
#         "A":
#             $ counter = counter + 1
#             jump a
#         "B":
#             $ counter = counter + 2
#             jump b

# label a:
#     scene boss office night

#     $ c = 10

#     hero "It's A! [counter] + [c]"

#     return

# label b:
#     scene boss office night

#     $ c = 20

#     hero "It's B! [counter] + [c]"

#     return
    


    # scene boss office night

    # show friend smile at center:
    #     zoom 0.75

    # e_1 "Здарова, я босс, если что."


    # scene street

    # show girl smile at center:
    #     zoom 0.85

    # g "Привет!"

    # scene stairs evening

    # show girl two angry at center:
    #     zoom 0.85

    # g_2 "Эй!"

    # scene cafeteria day

    # show girl three delighted at center:
    #     zoom 0.85

    # g_3 "Юхуу, минус 3!"

    # scene office

    # show girl four sad at center:
    #     zoom 0.85

    # g_4 "Плачу..."

    # scene train day rain

    # show friend two surprised at center:
    #     zoom 0.85

    # e_2 "Nani?"

    return
